{
    "title": "How to Build a JavaScript Command Line Interface (CLI) with Node.js",
    "date": "Sun 08-28-2022",
    "desc": "Build a CLI with NodeJs.",
    "content": "<p>In this article, we will see how to create a JavaScript CLI with the help of NodeJs.<\/p>\r\n\r\n<p>JavaScript being an interpreter language, it is a very dynamic language, due to which it provides us with many facilities, due to which many tasks become very easy and anyone can understand them very easily, so in today&#39;s era JavaScript It is one of the most popular programming languages ​​of the world, that is why today many tools are being built in it.<\/p>\r\n\r\n<p>In this article, we will build a CLI application with the help of JavaScript. We need NodeJs to run JavaScript directly<\/p>\r\n\r\n<p>If you have not installed NodeJs on your computer or facing any problem in NodeJs, then refer to <a href=\"https:\/\/www.geeksforgeeks.org\/installation-of-node-js-on-windows\/\">this article.<\/a><\/p>\r\n\r\n<h3>JavaScript(NodeJs) CLI Approach:<\/h3>\r\n\r\n<blockquote>\r\n<p>1) Setup NodeJs project.<\/p>\r\n\r\n<p>2) Understanding and working on NodeJs readline module.<\/p>\r\n\r\n<p>3) Understanding and working on the &quot;question&quot;, and &quot;createInterface&quot; method of NodeJs readline module.<\/p>\r\n\r\n<p>4) Writing and understanding code.<\/p>\r\n\r\n<p>5) Output.<\/p>\r\n<\/blockquote>\r\n\r\n<h3>Why do we need NodeJs:<\/h3>\r\n\r\n<p>We want to make a CLI application in JavaScript but JavaScript runs only on the browser but if we want to use it outside the browser then we will need a run-time that NodeJS provides so we have to use NodeJs. Then we will be able to create a CLI application with the help of JavaScript.<\/p>\r\n\r\n<p>If you want more information about NdoeJs refers to<a href=\"https:\/\/www.geeksforgeeks.org\/nodejs-tutorials\/\"> this article<\/a>.<\/p>\r\n\r\n<h4>Step1: Setup NodeJs Project.<\/h4>\r\n\r\n<p>In the first step, we set up a NodeJs project environment.<\/p>\r\n\r\n<p>If you do have not installed NPM or NodeJs please refer to <a href=\"https:\/\/www.geeksforgeeks.org\/installation-of-node-js-on-windows\/project.\">this article.<\/a><\/p>\r\n\r\n<p>run the below command and initiate the NodeJs project.<\/p>\r\n\r\n<blockquote>\r\n<p>npm init -y<\/p>\r\n<\/blockquote>\r\n\r\n<p>Use &quot;-y&quot; to keep default answers to all questions.<\/p>\r\n\r\n<p><img src=\"https:\/\/media.geeksforgeeks.org\/wp-content\/uploads\/20210802212938\/initgif.gif\" style=\"width:800px\" \/><\/p>\r\n\r\n<p>After doing the above things move to create an index.js file for writing our code, and the directory looks like this.<\/p>\r\n\r\n<p><img src=\"https:\/\/media.geeksforgeeks.org\/wp-content\/uploads\/20210802213119\/dirgit.jpg\" style=\"width:226px\" \/><\/p>\r\n\r\n<p>after set up the NodeJs project, move to the second step.<\/p>\r\n\r\n<h4>Step 2: Understanding and working on the NodeJs readline module.<\/h4>\r\n\r\n<p>The readline module allows reading a data stream one line at a time. It can be included in the code with the require() method. We can enter any stream of data we want in the readline module, which allows us to work with standard input and output streams. Or the readline module provides an interface for reading data from a Readable stream (such as process.stdin) one line at a time. It can be accessed using.<\/p>\r\n\r\n<p>If you want to more about the readline refers to <a href=\"https:\/\/www.geeksforgeeks.org\/node-js-readline-module\/\">this article.<\/a><\/p>\r\n\r\n<h4>Step 3: Understanding and working on the &quot;question&quot;, and &quot;createInterface&quot; method of NodeJs readline module.<\/h4>\r\n\r\n<p>The <strong>question<\/strong> method of the readline provides a facility to work a query-response mechanism we use the question method and pass two arguments first one is a query and the second one is a custom handler to take an argument as an input of the handler function.&nbsp;<\/p>\r\n\r\n<pre>\r\nreadline.question(query, callback);<\/pre>\r\n\r\n<p>Accepts the display query string and the callback function to be invoked as a response of the user&#39;s input to the query.<\/p>\r\n\r\n<p>The <strong>createInterface <\/strong>method of the readline provides an interface object to work with readline and their methods.<\/p>\r\n\r\n<pre>\r\nreadline.createInterface();<\/pre>\r\n\r\n<h4>Step 4: Writing and understanding code.<\/h4>\r\n\r\n<p>The below code shows the use of readline module for accepting input from the user as a CLI.<\/p>\r\n\r\n<p><strong>index.js<\/strong><\/p>\r\n\r\n<p>Javascript<\/p>\r\n\r\n<pre>\r\n<code>\/\/ import the readline module for work with stdin, or stdout.\r\nconst readline = require('readline');\r\n\r\n\/\/ create a readline object to work with the stream.\r\n\/\/ pass the stdin, or stdout in the current process.\r\nconst prompts = readline.createInterface(process.stdin, process.stdout);\r\n\r\n\/\/ create a question or there handler.\r\nprompts.question('Enter Learning Resources Name : ', (response) =&gt; {\r\n\r\n    \/\/ check the response.\r\n    if(response.toLocaleLowerCase() == 'gfg') {\r\n        console.log(\"You are a part of the very huge learning community.\");\r\n    }else {\r\n        console.log(\"Have a look at Geeksforgeeks, they solve many of your technical doubts.\");\r\n    }\r\n\r\n    \/\/ after the all work is done want to terminate this process.\r\n    process.exit();\r\n});\r\n<\/code><\/pre>\r\n\r\n<p>The createInterface method is used to create an interface to take user input. It takes two parameters, the standard input (stdin) &nbsp;and standard output (stdout) of the current process.<\/p>\r\n\r\n<p>Next, the question() method of the createInterface object is used to prompt a question to the user. The second parameter is a callback function the will process the user&#39;s input passed to it as a parameter. The logic inside the function will display an appropriate message based on the evaluation of the user&#39;s input value. The process.exit() statement allows to exit the code else the interface will keep reading from the standard input.<\/p>\r\n\r\n<h4>Step 5: Output.&nbsp;<\/h4>\r\n\r\n<p>NodeJs application can be run from &quot;node file_name.js&quot;<\/p>\r\n\r\n<p><img src=\"https:\/\/media.geeksforgeeks.org\/wp-content\/uploads\/20210729122700\/cli.gif\" style=\"width:800px\" \/><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n",
    "author": "Suryapratap Singh",
    "like": 0
}